{
  "landingPage": {
    "title": "👋 I'm Prafull Kumar Prajapati",
    "bio": "I'm a passionate Software Engineer with a strong background in backend development and distributed systems, complemented by experience across cloud infrastructure and data-intensive applications. For me, programming is the art of abstracting the world around us into elegant and efficient solutions.",
    "visitBtn": "Visit",
    "or": "or",
    "getCvBtn": "Get the CV"
  },
  "navbar": {
    "home": "Home",
    "experience": "Experience",
    "knowledge": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },
  "experience": {
    "utdMasters": {
      "title": "M.S. in Computer Science @UTD",
      "description": "Currently pursuing my Master's degree at the University of Texas at Dallas with a perfect GPA of 4.0/4.0. Recipient of the Dean's Scholarship for Outstanding Academic Achievement. My coursework includes Database Design, Operating Systems, Object-Oriented Programming, Machine Learning, and Software Development. During my studies, I also completed a Summer 2025 internship at AWS and serve as a Teaching Assistant, mentoring students in Java and software engineering courses.",
      "time": "2024 – Present"
    },
    "awsIntern": {
      "title": "Software Development Engineer Intern @AWS (During MS)",
      "description": "During my Master's program, I interned at Amazon Web Services in Seattle, where I integrated Java-based long polling in DynamoDB microservices to reduce redundant requests. I evaluated multiple design approaches for scalability and growth, and optimized concurrency with configurable timeouts and async request-reply patterns. This work resulted in an 84% reduction in total requests, significantly lowering CPU usage, memory consumption, file descriptor usage, and network I/O.",
      "time": "Summer 2025"
    },
    "livsytLead": {
      "title": "Backend Team Lead @LivSYT",
      "description": "Led the backend team and successfully migrated services from AWS to Azure, resulting in a 25% reduction in infrastructure costs. Designed scalable microservices using TypeScript with Sequelize and Node.js. Implemented deployments using AWS Lambda and SAM, improving Lambda cold start times by 30%. Managed CI/CD pipelines using Azure DevOps and led a team of 4 engineers, securing key clients through rapid API delivery.",
      "time": "Jun 2021 – Jul 2024"
    },
    "arthDev": {
      "title": "Software Developer @Arth",
      "description": "Built API Gateway and SES integration for email delivery, reducing rejected emails by 60% through implementation of an SQS retry mechanism. Designed .NET microservices on Azure Cloud, achieving 99.9% uptime. Developed comprehensive unit testing infrastructure with in-memory database integration.",
      "time": "Jan 2021 – May 2021"
    },
    "iitKgp": {
      "title": "B.Tech in Aerospace Engineering @IIT Kharagpur",
      "description": "Graduated from the prestigious Indian Institute of Technology, Kharagpur with a GPA of 3.3/4.0. Coursework included Data Structures & Algorithms, Probability & Statistics, and Computer Architecture. Served as Secretary of Cricket, managing an $80k budget and leading the team to a bronze medal.",
      "time": "2017 – 2021"
    },
    "research": {
      "title": "Research Publication",
      "description": "Published research on 'Improving Algebraic Expression Generation using Crow Search-based Genetic Algorithm' at the 20th Applied Computing Conference (2023).",
      "time": "2023"
    },
    "achievements": {
      "title": "Technical Achievements",
      "description": "Ranked in the top 1% on LeetCode (2022). Achieved top rankings in national engineering entrance exams: JEE Advanced (Top 3%) and JEE Mains (Top 0.6%) in 2017.",
      "time": "2017 – Present"
    }
  },
  "skills": {
    "java": "java:",
    "kotlin": "kotlin:",
    "flutter": "flutter:",
    "javascript": "javascript:",
    "react": "react:",
    "nextJs": "next.js:",
    "tailwind": "tailwind:",
    "posgresql": "posgtresql:",
    "nodeJs": "node.js:",
    "firebase": "firebase:",
    "supabase": "supabase:",
    "mongodb": "mongodb:",
    "ffmpeg": "ffmpeg:",
    "italian": "italian:",
    "english": "english:",
    "german": "german:",
    "mobile": "mobile",
    "web": "web",
    "dbBackend": "db & backend",
    "mediaProc": "media proc.",
    "language": "languages"
  },
  "projects": {
    "afse": {
      "title": "Marvel Stickers Collection",
      "description": "Discover a web application built entirely with vanilla JavaScript, developed for a university exam. This app allows users to collect, buy, and trade Marvel stickers. The frontend is powered by a custom framework I created to ensure a smooth Single Page Application (SPA) experience, providing seamless navigation. Enjoy an intuitive interface for managing your collection and engaging in trades with others."
    },
    "portfolio": {
      "title": "Personal portfolio",
      "description": "Explore my portfolio built with Next.js and styled using Tailwind CSS and DaisyUI. The site is fully responsive, multilingual (Italian, English, and German), and automatically adapts to the user's system preferences for language and color scheme (light or dark mode), providing a personalized and accessible experience.\nI have focused on both server-side and client-side rendering optimizations to ensure fast load times and high performance. The interface is modern and consistent, designed to highlight my skills, projects, and professional experience.\nThe website is optimized for both technical and semantic SEO: it uses structured tags, localized dynamic metadata (title, description, canonical, hreflang), supports Twitter Cards and Open Graph for effective social sharing, and implements a multilingual sitemap and a custom robots.txt file. It follows Google's mobile-first indexing guidelines and accessibility best practices."
    },
    "sustain": {
      "title": "Sustain – Solo HackUTD 2024 Project",
      "description": "Sustain is a solo 24-hour hackathon project I created at HackUTD 2024 to quantify sustainability metrics for real estate properties. The web app helps inspectors and property managers evaluate and visualize a building's environmental performance by categorizing it into sustainability tiers. Built with Node.js (LoopBack) and PostgreSQL on Amazon RDS, and deployed on AWS EC2 with a responsive HTML/CSS frontend, the project demonstrates my ability to deliver a full-stack, cloud-deployed solution under intense time constraints while addressing a real-world problem in sustainable development."
    },
    "fakeFootball": {
      "title": "Team Management & Match Streaming",
      "description": "This app, developed with Flutter, was initially created to meet my personal needs in managing a football team, and is available on both mobile and desktop. It includes features such as squad management, individual player statistics, and match streaming via OBS Studio, with custom graphics generated in real-time using FFmpeg. The app also automates the creation of post-match video content in both vertical and horizontal formats, optimized for sharing across various social media platforms. While originally built for personal use, the goal is now to refine and commercialize it as a comprehensive tool—not only for coaches, players, and content creators, but also for teams in all kinds of team sports."
    },
    "trivia": {
      "title": "Trivia Escape",
      "description": "Join a 2D space-themed trivia adventure! Guide the ball through intricate mazes by answering questions correctly to reach the exit. The game features two modes: a relaxed mode without time limits, and a timed mode for those seeking a tougher challenge. The long-term goal is to evolve the project into a multiplayer experience, making it even more engaging and competitive."
    },
    "public": "public",
    "private": "private"
  },
  "contact": {
    "formTitle": "get in touch",
    "nameForm": "Name",
    "emailForm": "Email",
    "messageForm": "Message",
    "submitBtn": "Submit",
    "okBtn": "Message sent",
    "errorBtn": "Something went wrong",
    "contactTitle": "contact info",
    "location": "Richardson, TX",
    "rights": "© 2025 Prafull Kumar Prajapati. All rights reserved"
  },
  "meta": {
    "home": {
      "title": "Prafull Kumar Prajapati - Software Engineer",
      "description": "Portfolio of Prafull Kumar Prajapati, a software engineer specializing in backend development, distributed systems, and cloud infrastructure."
    },
    "experience": {
      "title": "Experience - Prafull Kumar Prajapati",
      "description": "Explore Prafull's work experience in software engineering, including roles at AWS, LivSYT, and more."
    },
    "skills": {
      "title": "Skills - Prafull Kumar Prajapati",
      "description": "Programming languages, tools, and technologies Prafull uses in his projects."
    },
    "projects": {
      "title": "Projects - Prafull Kumar Prajapati",
      "description": "A selection of personal and professional projects developed by Prafull."
    },
    "contact": {
      "title": "Contact - Prafull Kumar Prajapati",
      "description": "Get in touch with Prafull for collaborations, opportunities, or tech networking."
    }
  }
}
